OBU5/STM32L433CC-Powerbank/src/main.c
/**
 ******************************************************************************
 * File Name          : main.c
 * Description        : Main program body
 ******************************************************************************
 ** This notice applies to any and all portions of this file
 * that are not between comment pairs USER CODE BEGIN and
 * USER CODE END. Other portions of this file, whether
 * inserted by the user or by software development tools
 * are owned by their respective copyright owners.
 *
 * COPYRIGHT(c) 2018 STMicroelectronics
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32l4xx_hal.h"

#include "config.h"
#include "events.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim16;
uint16_t dutyCycle = 0;
UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

uint32_t collectorADC[12];

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM16_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_RTC_Init(void);

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void) {

	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration----------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_DMA_Init();
	MX_SPI2_Init();
	MX_USART3_UART_Init();
	MX_ADC1_Init();
	MX_TIM1_Init();
	MX_TIM2_Init();
	MX_RTC_Init();
	/* USER CODE BEGIN 2 */
	initGPIOs();
	turnOnPowerbank();
	initADCs();
	initLCD();

	HAL_ADC_Start_DMA(&hadc1, collectorADC, 12);

	HAL_TIM_Base_Start_IT(&htim1); //Start the timer
	HAL_TIM_Base_Start_IT(&htim2); //Start the timer
/*
	MX_TIM16_Init();

	HAL_TIM_Base_Start_IT(&htim16); //Start the timer
	HAL_TIMEx_PWMN_Start_IT(&htim16, TIM_CHANNEL_1); //starts PWM on CH1N pin
*/
	HAL_Delay(100);
	HAL_ADC_Start_IT(&hadc1);
	HAL_Delay(100);
	HAL_ADCEx_Calibration_Start(&hadc1, ADC_SINGLE_ENDED);
	HAL_Delay(100);
	HAL_ADC_Start_IT(&hadc1);
	HAL_Delay(100);
	HAL_ADC_Start_IT(&hadc1);
	HAL_Delay(100);
	HAL_ADC_Start_IT(&hadc1);
	HAL_Delay(100);
	HAL_ADC_Start_IT(&hadc1);
	HAL_Delay(100);

	initCells();
	refreshCellsVoltage();
	initOutVoltage();

	//__HAL_RCC_PWR_CLK_ENABLE()	;

	/* USER CODE END 2 */
	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1) {
		/* USER CODE END WHILE*/
		writeOnLCDByMenuIndex();
		HAL_Delay(10);
		HAL_ADC_Start_IT(&hadc1);
		checkCharger();
		/* USER CODE BEGIN 3 */

	}
	/* USER CODE END 3 */

}

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc) {
	measureADC(&voltageCell1P, collectorADC[0]);
	measureADC(&voltageCell2P, collectorADC[1]);
	measureADC(&voltageCell3P, collectorADC[2]);
	measureADC(&voltageCell4P, collectorADC[3]);
	measureADC(&tempCell, collectorADC[4]);
	measureADC(&tempBalancer, collectorADC[5]);
	measureADC(&voltageAdapter, collectorADC[6]);
	measureADC(&currentCharge, collectorADC[7]);
	measureADC(&currentDischarge, collectorADC[8]);
	measureADC(&tempMCU, collectorADC[9]);
	measureADC(&voltageBat, collectorADC[10]);
	measureADC(&Vrefint, collectorADC[11]);

}

void EXTI1_IRQHandler(void) {
	HAL_NVIC_ClearPendingIRQ(EXTI1_IRQn);
	HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_1);
	{
		/* EXTI line interrupt detected */
		if (__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_1) != SET) {

			//	writeOnLCDByMenuIndex();

			__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_1);
			HAL_GPIO_EXTI_Callback(GPIO_PIN_1);
		}
	}
}

void EXTI2_IRQHandler(void) {
	HAL_NVIC_ClearPendingIRQ(EXTI2_IRQn);
	HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_2);
	{
		/* EXTI line interrupt detected*/
		if (__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_2) != SET) {

