OBU5/STM32L433CC-Powerbank/src/main.c
			//writeOnLCDByMenuIndex();

			__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_2);
			HAL_GPIO_EXTI_Callback(GPIO_PIN_2);

		}
	}
}

void EXTI15_10_IRQHandler(void) {
	HAL_NVIC_ClearPendingIRQ(EXTI15_10_IRQn);
	HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_15);
	{
		/* EXTI line interrupt detected */
		if (__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_15) != SET) {

			__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_15);
			HAL_GPIO_EXTI_Callback(GPIO_PIN_15);
		}
	}
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
	if (htim->Instance == TIM1) {
		tickButtonsTimer();
		tickIntegralTimer();

	} else if (htim->Instance == TIM2) {
		tickIntegralTimer();
		refreshCellsVoltage();
		backlightCheck();
	}
}
	/** System Clock Configuration
	 */
	void SystemClock_Config(void) {

		RCC_OscInitTypeDef RCC_OscInitStruct;
		RCC_ClkInitTypeDef RCC_ClkInitStruct;
		RCC_PeriphCLKInitTypeDef PeriphClkInit;

		/**Initializes the CPU, AHB and APB busses clocks
		 */
		RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI
				| RCC_OSCILLATORTYPE_HSE;
		RCC_OscInitStruct.HSEState = RCC_HSE_ON;
		RCC_OscInitStruct.LSIState = RCC_LSI_ON;
		RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
		if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		/**Initializes the CPU, AHB and APB busses clocks
		 */
		RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
				| RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
		RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
		RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
		RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
		RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

		if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0)
				!= HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC
				| RCC_PERIPHCLK_USART3 | RCC_PERIPHCLK_ADC;
		PeriphClkInit.Usart3ClockSelection = RCC_USART3CLKSOURCE_PCLK1;
		PeriphClkInit.AdcClockSelection = RCC_ADCCLKSOURCE_PLLSAI1;
		PeriphClkInit.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
		PeriphClkInit.PLLSAI1.PLLSAI1Source = RCC_PLLSOURCE_HSE;
		PeriphClkInit.PLLSAI1.PLLSAI1M = 1;
		PeriphClkInit.PLLSAI1.PLLSAI1N = 8;
		PeriphClkInit.PLLSAI1.PLLSAI1P = RCC_PLLP_DIV7;
		PeriphClkInit.PLLSAI1.PLLSAI1Q = RCC_PLLQ_DIV2;
		PeriphClkInit.PLLSAI1.PLLSAI1R = RCC_PLLR_DIV2;
		PeriphClkInit.PLLSAI1.PLLSAI1ClockOut = RCC_PLLSAI1_ADC1CLK;
		if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		/**Configure the main internal regulator output voltage
		 */
		if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1)
				!= HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		/**Configure the Systick interrupt time
		 */
		HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq() / 1000);

		/**Configure the Systick
		 */
		HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

		/* SysTick_IRQn interrupt configuration */
		//HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
		HAL_NVIC_SetPriority(-1, 0, 0);
	}

	/* ADC1 init function */
	static void MX_ADC1_Init(void) {

		ADC_ChannelConfTypeDef sConfig;

		/**Common config
		 */
		hadc1.Instance = ADC1;
		hadc1.Init.ClockPrescaler = ADC_CLOCK_ASYNC_DIV1;
		hadc1.Init.Resolution = ADC_RESOLUTION_12B;
		hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
		hadc1.Init.ScanConvMode = ADC_SCAN_ENABLE;
		hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
		hadc1.Init.LowPowerAutoWait = DISABLE;
		hadc1.Init.ContinuousConvMode = DISABLE;
		hadc1.Init.NbrOfConversion = 12;
		hadc1.Init.DiscontinuousConvMode = DISABLE;
		hadc1.Init.NbrOfDiscConversion = 1;
		hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
		hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
		hadc1.Init.DMAContinuousRequests = DISABLE;
		hadc1.Init.Overrun = ADC_OVR_DATA_PRESERVED;
		hadc1.Init.OversamplingMode = DISABLE;
		if (HAL_ADC_Init(&hadc1) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		/**Configure Regular Channel
		 */
		sConfig.Channel = ADC_CHANNEL_5;
		sConfig.Rank = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_92CYCLES_5;
		sConfig.SingleDiff = ADC_SINGLE_ENDED;
		sConfig.OffsetNumber = ADC_OFFSET_NONE;
		sConfig.Offset = 0;
		if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		/**Configure Regular Channel
		 */
		sConfig.Channel = ADC_CHANNEL_6;
		sConfig.Rank = 2;
		if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		/**Configure Regular Channel
		 */
		sConfig.Channel = ADC_CHANNEL_7;
		sConfig.Rank = 3;
		if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		/**Configure Regular Channel
		 */
		sConfig.Channel = ADC_CHANNEL_8;
		sConfig.Rank = 4;
		if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		/**Configure Regular Channel
		 */
		sConfig.Channel = ADC_CHANNEL_9;
		sConfig.Rank = 5;
		if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		/**Configure Regular Channel
		 */
		sConfig.Channel = ADC_CHANNEL_10;
		sConfig.Rank = 6;
		if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		/**Configure Regular Channel
		 */
		sConfig.Channel = ADC_CHANNEL_11;
		sConfig.Rank = 7;
		if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		/**Configure Regular Channel
		 */
		sConfig.Channel = ADC_CHANNEL_12;
		sConfig.Rank = 8;
		if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		/**Configure Regular Channel
		 */
		sConfig.Channel = ADC_CHANNEL_15;
		sConfig.Rank = 9;
		if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		/**Configure Regular Channel
		 */
		sConfig.Channel = ADC_CHANNEL_TEMPSENSOR;
		sConfig.Rank = 10;
		if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		/**Configure Regular Channel
		 */
		sConfig.Channel = ADC_CHANNEL_VBAT;
		sConfig.Rank = 11;
		if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		/**Configure Regular Channel
		 */
		sConfig.Channel = ADC_CHANNEL_VREFINT;
		sConfig.Rank = 12;
		if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

