OBU5/STM32L433CC-Powerbank/src/main.c
	}

	/* RTC init function */
	static void MX_RTC_Init(void) {

		RTC_TimeTypeDef sTime;
		RTC_DateTypeDef sDate;
		RTC_AlarmTypeDef sAlarm;
		RTC_TamperTypeDef sTamper;

		/**Initialize RTC Only
		 */
		hrtc.Instance = RTC;
		hrtc.Init.HourFormat = RTC_HOURFORMAT_24;
		hrtc.Init.AsynchPrediv = 127;
		hrtc.Init.SynchPrediv = 255;
		hrtc.Init.OutPut = RTC_OUTPUT_DISABLE;
		hrtc.Init.OutPutRemap = RTC_OUTPUT_REMAP_NONE;
		hrtc.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
		hrtc.Init.OutPutType = RTC_OUTPUT_TYPE_OPENDRAIN;
		if (HAL_RTC_Init(&hrtc) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		/**Initialize RTC and set the Time and Date
		 */
		if (HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR0) != 0x32F2) {
			sTime.Hours = 0x0;
			sTime.Minutes = 0x0;
			sTime.Seconds = 0x0;
			sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
			sTime.StoreOperation = RTC_STOREOPERATION_RESET;
			if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BCD) != HAL_OK) {
				_Error_Handler(__FILE__, __LINE__);
			}

			sDate.WeekDay = RTC_WEEKDAY_MONDAY;
			sDate.Month = RTC_MONTH_JANUARY;
			sDate.Date = 0x1;
			sDate.Year = 0x0;

			if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BCD) != HAL_OK) {
				_Error_Handler(__FILE__, __LINE__);
			}

			HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR0, 0x32F2);
		}
		/**Enable the Alarm A
		 */
		sAlarm.AlarmTime.Hours = 0x0;
		sAlarm.AlarmTime.Minutes = 0x0;
		sAlarm.AlarmTime.Seconds = 0x0;
		sAlarm.AlarmTime.SubSeconds = 0x0;
		sAlarm.AlarmTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
		sAlarm.AlarmTime.StoreOperation = RTC_STOREOPERATION_RESET;
		sAlarm.AlarmMask = RTC_ALARMMASK_NONE;
		sAlarm.AlarmSubSecondMask = RTC_ALARMSUBSECONDMASK_ALL;
		sAlarm.AlarmDateWeekDaySel = RTC_ALARMDATEWEEKDAYSEL_DATE;
		sAlarm.AlarmDateWeekDay = 0x1;
		sAlarm.Alarm = RTC_ALARM_A;
		if (HAL_RTC_SetAlarm_IT(&hrtc, &sAlarm, RTC_FORMAT_BCD) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		/**Enable the RTC Tamper 1
		 */
		sTamper.Tamper = RTC_TAMPER_1;
		sTamper.Interrupt = RTC_TAMPER1_INTERRUPT;
		sTamper.Trigger = RTC_TAMPERTRIGGER_RISINGEDGE;
		sTamper.NoErase = RTC_TAMPER_ERASE_BACKUP_ENABLE;
		sTamper.MaskFlag = RTC_TAMPERMASK_FLAG_DISABLE;
		sTamper.Filter = RTC_TAMPERFILTER_DISABLE;
		sTamper.SamplingFrequency = RTC_TAMPERSAMPLINGFREQ_RTCCLK_DIV32768;
		sTamper.PrechargeDuration = RTC_TAMPERPRECHARGEDURATION_1RTCCLK;
		sTamper.TamperPullUp = RTC_TAMPER_PULLUP_ENABLE;
		sTamper.TimeStampOnTamperDetection =
				RTC_TIMESTAMPONTAMPERDETECTION_ENABLE;
		if (HAL_RTCEx_SetTamper_IT(&hrtc, &sTamper) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

	}

	/* SPI2 init function */
	static void MX_SPI2_Init(void) {

		hspi2.Instance = SPI2;
		hspi2.Init.Mode = SPI_MODE_MASTER;
		hspi2.Init.Direction = SPI_DIRECTION_2LINES;
		hspi2.Init.DataSize = SPI_DATASIZE_8BIT;
		hspi2.Init.CLKPolarity = SPI_POLARITY_LOW;
		hspi2.Init.CLKPhase = SPI_PHASE_1EDGE;
		hspi2.Init.NSS = SPI_NSS_SOFT;
		hspi2.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;
		hspi2.Init.FirstBit = SPI_FIRSTBIT_MSB;
		hspi2.Init.TIMode = SPI_TIMODE_DISABLE;
		hspi2.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
		hspi2.Init.CRCPolynomial = 7;
		hspi2.Init.CRCLength = SPI_CRC_LENGTH_DATASIZE;
		hspi2.Init.NSSPMode = SPI_NSS_PULSE_ENABLE;

		if (HAL_SPI_Init(&hspi2) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

	}

	/* TIM1 init function */
	static void MX_TIM1_Init(void) {

		TIM_ClockConfigTypeDef sClockSourceConfig;
		TIM_MasterConfigTypeDef sMasterConfig;

		htim1.Instance = TIM1;
		htim1.Init.Prescaler = 1999;
		htim1.Init.CounterMode = TIM_COUNTERMODE_UP;
		htim1.Init.Period = 19;
		htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
		htim1.Init.RepetitionCounter = 0;

		if (HAL_TIM_Base_Init(&htim1) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
		if (HAL_TIM_ConfigClockSource(&htim1, &sClockSourceConfig) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
		sMasterConfig.MasterOutputTrigger2 = TIM_TRGO2_RESET;
		sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
		if (HAL_TIMEx_MasterConfigSynchronization(&htim1, &sMasterConfig)
				!= HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

	}

	/* TIM2 init function */
	static void MX_TIM2_Init(void) {

		TIM_ClockConfigTypeDef sClockSourceConfig;
		TIM_MasterConfigTypeDef sMasterConfig;

		htim2.Instance = TIM2;
		htim2.Init.Prescaler = 7999;
		htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
		htim2.Init.Period = 49;
		htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
		if (HAL_TIM_Base_Init(&htim2) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
		if (HAL_TIM_ConfigClockSource(&htim2, &sClockSourceConfig) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

		sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
		sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
		if (HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMasterConfig)
				!= HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

	}

	/* TIM16 init function */

	/* TIM16 init function */
	static void MX_TIM16_Init(void) {

		TIM_ClockConfigTypeDef sClockSourceConfig;
		TIM_MasterConfigTypeDef sMasterConfig;
		TIM_OC_InitTypeDef sConfigOC;

		htim16.Instance = TIM16;
		htim16.Init.Prescaler = 1;
		htim16.Init.CounterMode = TIM_COUNTERMODE_UP;
		htim16.Init.Period = 1;
		htim16.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
		if (HAL_TIM_Base_Init(&htim16) != HAL_OK) {
			Error_Handler();
		}

		sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
		if (HAL_TIM_ConfigClockSource(&htim16, &sClockSourceConfig) != HAL_OK) {
			Error_Handler();
		}

		if (HAL_TIM_PWM_Init(&htim16) != HAL_OK) {
			Error_Handler();
		}

