OBU5/STM32L433CC-Powerbank/src/main.c
		sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
		sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
		if (HAL_TIMEx_MasterConfigSynchronization(&htim16, &sMasterConfig)
				!= HAL_OK) {
			Error_Handler();
		}

		sConfigOC.OCMode = TIM_OCMODE_PWM1;
		sConfigOC.Pulse = 1;
		sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
		sConfigOC.OCFastMode = TIM_OCFAST_ENABLE;
		if (HAL_TIM_PWM_ConfigChannel(&htim16, &sConfigOC, TIM_CHANNEL_1)
				!= HAL_OK) {
			Error_Handler();
		}

		HAL_TIM_MspPostInit(&htim16);
	}

	/* USART3 init function */
	static void MX_USART3_UART_Init(void) {

		huart3.Instance = USART3;
		huart3.Init.BaudRate = 115200;
		huart3.Init.WordLength = UART_WORDLENGTH_7B;
		huart3.Init.StopBits = UART_STOPBITS_1;
		huart3.Init.Parity = UART_PARITY_NONE;
		huart3.Init.Mode = UART_MODE_TX_RX;
		huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
		huart3.Init.OverSampling = UART_OVERSAMPLING_16;
		huart3.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
		huart3.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
		if (HAL_UART_Init(&huart3) != HAL_OK) {
			_Error_Handler(__FILE__, __LINE__);
		}

	}

	/**
	 * Enable DMA controller clock
	 */
	static void MX_DMA_Init(void) {
		/* DMA controller clock enable */
		__HAL_RCC_DMA1_CLK_ENABLE()
		;

		/* DMA interrupt init */
		/* DMA1_Channel1_IRQn interrupt configuration */
		HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 0, 0);
		HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);

	}

	/** Configure pins as
	 * Analog
	 * Input
	 * Output
	 * EVENT_OUT
	 * EXTI
	 */
	static void MX_GPIO_Init(void) {

		GPIO_InitTypeDef GPIO_InitStruct;

		/* GPIO Ports Clock Enable */
		__HAL_RCC_GPIOC_CLK_ENABLE()
		;
		__HAL_RCC_GPIOH_CLK_ENABLE()
		;
		__HAL_RCC_GPIOA_CLK_ENABLE()
		;
		__HAL_RCC_GPIOB_CLK_ENABLE()
		;

		/*Configure GPIO pin Output Level */
		HAL_GPIO_WritePin(GPIOB,
				GPIO_PIN_12 | GPIO_PIN_14 | GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5
						| GPIO_PIN_7 | GPIO_PIN_9, GPIO_PIN_RESET);

		/*Configure GPIO pin Output Level */
		HAL_GPIO_WritePin(GPIOA,
		GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12,
				GPIO_PIN_RESET);

		/*Configure GPIO pins : PB1 PB2 */
		GPIO_InitStruct.Pin = GPIO_PIN_1 | GPIO_PIN_2;
		GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING_FALLING;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

//Added for enable interrupt for PB1 and PB2 with priority 3
		HAL_NVIC_SetPriority(EXTI1_IRQn, 3, 0);
		HAL_NVIC_EnableIRQ(EXTI1_IRQn);
		HAL_NVIC_SetPriority(EXTI2_IRQn, 3, 0);
		HAL_NVIC_EnableIRQ(EXTI2_IRQn);

		/*Configure GPIO pins : PB12 PB14 PB3 PB4
		 PB5 PB7 PB9 */
		GPIO_InitStruct.Pin = GPIO_PIN_12 | GPIO_PIN_14 | GPIO_PIN_3
				| GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_7 | GPIO_PIN_9;
		GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
		HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

		/*Configure GPIO pins : PA8 PA9 PA10 PA11
		 PA12 */
		GPIO_InitStruct.Pin = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10
				| GPIO_PIN_11 | GPIO_PIN_12;
		GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
		HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

		/*Configure GPIO pin : PA15 */
		GPIO_InitStruct.Pin = GPIO_PIN_15;
		GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING_FALLING;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

		//Added for enable interrupt for PA15 with priority 3
		HAL_NVIC_SetPriority(EXTI15_10_IRQn, 3, 0);
		HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

		/*Configure GPIO pin : PB8 */
		GPIO_InitStruct.Pin = GPIO_PIN_8;
		GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

	}

	/* USER CODE BEGIN 4 */

	/* USER CODE END 4 */

	/**
	 * @brief  This function is executed in case of error occurrence.
	 * @param  None
	 * @retval None
	 */
	void _Error_Handler(char * file, int line) {
		/* USER CODE BEGIN Error_Handler_Debug */
		/* User can add his own implementation to report the HAL error return state */
		while (1) {
		}
		/* USER CODE END Error_Handler_Debug */
	}

#ifdef USE_FULL_ASSERT

	/**
	 * @brief Reports the name of the source file and the source line number
	 * where the assert_param error has occurred.
	 * @param file: pointer to the source file name
	 * @param line: assert_param error line source number
	 * @retval None
	 */
	void assert_failed(uint8_t* file, uint32_t line)
	{
		/* USER CODE BEGIN 6 */
		/* User can add his own implementation to report the file name and line number,
		 ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
		/* USER CODE END 6 */

	}

#endif

	/**
	 * @}
	 */

	/**
	 * @}
	 */

	/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
